#name=Nick #შეცდომაა, str–ს სჭირდება ბრჭაყლები

name="Nick" #სწორი გზა

#name="Nick"
#age=14
#print(name+" "age)   #შეცდომაა,str–ს და int–ს ერთმანეთს ვერ დავუმატებთ

name="Nick"
age=14
print(name+str(age))  #სწორი გზა

#color->yellow  #შეცდომაა,აქ ცვალდს მნიშვნელობა რომ მივცეთ საჭიროას ტოლობი ნიშანი და ბრჭყალები

color="yellow"  #სწორი გზა

#print(my name is Nick) #შეცდომაა,რადგან str-ის გამოსატანად საჭიროა ბრჭყალები

print("hello me name is Nick") #სწორი გზა

#print(5+"5") #შეცდომაა,რადგან როდესაც int–ებს ერთმანეთს ვუმატებთ ბრჭყალებს არ ვიყენებთ

print(5+5) #სწორი გზა

#points=100
#print(points+lives)
#lives=3  #შეცდომაა,კოდის წერის დროს თანმიმდევრობის დაცვა აუცილებელია

points=100
lives=3
print(points+lives)  #სწორი გზა

#color->red  #შეცდომაა ამ ცვლადის გამოსაყვანად საჭიროა ტოლობის ნიშანი და ბრჭყალები

color="red" #სწორი გზა

#age="14" #შეცდომაა,თუ ჩვენ ამ ცვლადის int–ად გამოყვანა გვსურს ბრჭყალები არ გვჭირდება 

age=14   #სწორი გზა

#print"4+8"  #შეცდომაა,მათემატიკურ ოპერაციას ფრჩხილები სჭირდება

print(4+8)  #სწორი გზა

#name="nick'  #შეცდომაა,თუ ვიწყებთ ორი ბრჭყალიტ უნდა დავასრულოთ ორი ბრჭყალით.იგივე წესია ერთ ბრჭაყლზე

name="nick"  #სწორი გზა
